SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( 1960Driving
	Type ( Engine )
	WagonShape ( 1960Driving.s )
	Size  ( 2.62m 2.6m 15.8m  )
	CentreOfGravity ( 0m 2.25m 1m )
	Mass ( 29.15t )
	WheelRadius ( 0.788m )
	InertiaTensor ( Box ( 2.62m 2.6m 15.8m ) )
	FreightAnim ( .\\Front_Destination\\CentralDestination.s 0.1 0.1 )
	Coupling (
		Type ( Bar )
		Spring (
			Stiffness ( 5e6N/m 0 )
			Damping ( 1e6N/m/s 0)
			Break ( 2e7N 0 )
			r0 ( 15cm 1e9 )
		)
		CouplingHasRigidConnection ()
)
	Coupling (
		Type ( Automatic )
		Spring (
			Stiffness ( 5e6N/m 0 )
			Damping ( 1e6N/m/s 0)
			Break ( 2e7N 0 )
			r0 ( 15cm 1e9 )
		)
		CouplingHasRigidConnection ()
		Velocity ( 0.1m/s )
	)
	Buffers (
		Spring (
			Stiffness ( 1e7N/m 0 )
			Damping ( 1e6N/m/s 0 )
			r0 ( 0m 1e9 )
		)
		Centre ( 0.5 )
		Radius ( 1 )
		Angle ( 0.5deg )
	)

	Adheasion ( 0.2 0.4 2 0 )
	DerailRailHeight ( 10cm )
	DerailRailForce ( 150kN )
	DerailBufferForce ( 800kN )
	NumWheels (	8 )

	Comment ( Friction/drag calculated using Joe Realmuto FCALC2 )
	Comment ( DM unit friction based on 27.4t + 1.78t mass, 10.32 sq m frontal area, drag coeff 1.0 )
	Comment ( 1.78t = 4000lbs = 55% passenger load )
	Comment ( Unit is at front of train )
	Friction (
		586.3N/m/s	-0.05	1.4mph	8.655N/m/s	1.904
		5.1N/rad/s	1	-1rad/s	0	1
	)

	AntiSlip ()
	
Inside (
                PassengerCabinFile ( 1960Driving.s )
                PassengerCabinHeadPos ( 0.75 2.04 0.70 )
                RotationLimit ( 55 55 0 )
		StartDirection ( 1 -10 0 )
		Sound ( "LURpas.sms" )
)
	PassengerCapacity ( 32 )

	Comment ( EP brake system, no graduated release )
	BrakeEquipmentType ( "Graduated_release_triple_valve, Emergency_reservoir, Auxilary_reservoir" )
	BrakeSystemType ( "Air_single_pipe" )
	MaxBrakeForce( 50kN )
	EmergencyBrakeResMaxPressure( 80 )
	TripleValveRatio( 4.0 )
	MaxReleaseRate( 10 )
	MaxApplicationRate( 10 )
	MaxAuxilaryChargingRate( 20 )
	EmergencyResCapacity( 15 )
	EmergencyResChargingRate( 20 )
	BrakeCylinderPressureForMaxBrakeBrakeForce( 55 )

	Lights ( 6

		comment ( NOTE: Lights use MSTS BIN features! )

		comment ( Player lights )
		comment ( Headlight 4 = 2or3 = dim or bright -- bright front lights, red rear lights )

		Light	(
			comment( Front car Juice shoes - offside, front then rear )
			Type ( 0 )
			Conditions	(
				Headlight ( 0 )
				Service ( 0 )
				Weather ( 0 )
				Unit ( 0 )
			)
			FadeIn ( 0 )
			FadeOut ( 0 )
			Cycle ( 0 )
			States ( 8
				State	(
					Duration ( 0.2 )
					LightColour ( ff00ccff )
					Position ( 1.20 0.05 5.0 )
					Azimuth ( 0 -180 180 )
					Transition ( 0 )
					Radius ( 3 )
				)
				State	(
					Duration ( 0.1 )
					LightColour ( ff00ccff )
					Position ( 0 0.05 5.0 )
					Azimuth ( 0 -180 180 )
					Transition ( 0 )
					Radius ( 3 )
				)
				State	(
					Duration ( 0.1 )
					LightColour ( 8000ccff )
					Position ( 1.20 0.05 5.0 )
					Azimuth ( 0 -180 180 )
					Transition ( 0 )
					Radius ( 2 )
				)
				State	(
					Duration ( 1 )
					LightColour ( 80000000 )
					Position ( 1.20 0.05 5.0 )
					Azimuth ( 0 -180 180 )
					Transition ( 0 )
					Radius ( 7 )
				)
				State	(
					Duration ( 0.2 )
					LightColour ( ff00ccff )
					Position ( 1.20 0.05 -5.0 )
					Azimuth ( 0 -180 180 )
					Transition ( 0 )
					Radius ( 3 )
				)
				State	(
					Duration ( 0.1 )
					LightColour ( 80000000 )
					Position ( 1.20 0.05 -5.0 )
					Azimuth ( 0 -180 180 )
					Transition ( 0 )
					Radius ( 3 )
				)
				State	(
					Duration ( 0.1 )
					LightColour ( 8000ccff )
					Position ( 1.20 0.05 -5.0 )
					Azimuth ( 0 -180 180 )
					Transition ( 0 )
					Radius ( 2 )
				)
				State	(
					Duration ( 25 )
					LightColour ( 80000000 )
					Position ( 1.20 0.05 -5.0 )
					Azimuth ( 0 -180 180 )
					Transition ( 0 )
					Radius ( 7 )
				)
			)
		)

		Light	(
			comment( Sphere of light bright HL=2or3 )
			Type ( 1 )
			Conditions (
				Headlight ( 4 )
				Unit ( 2 )
			)
			Cycle	( 0 )
			FadeIn ( 0.25 )
			FadeOut ( 0.25 )
			States ( 1
				State	(
					Duration ( 0.0 )
					LightColour ( a0a0a050 )
					Position ( 0.0 1.28 5.00 )
					Transition ( 0 )
					Radius ( 100.0 )
					Angle ( 15.0 )
				)
			)
		)
			
		comment ( Unit 2 = front, normal cab, RMD headcode )

		Light	(
			comment( Head light right btm HL=2or3 )
			Type ( 0 )
			Conditions (
				Headlight ( 4 )
				Unit ( 2 )
				)
			FadeIn ( 0.25 )
			FadeOut ( 0.25 )
			Cycle	( 0 )
			States ( 1
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffc0 )
					Position ( 0.96 1.50 8.03 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.15 )
					Elevation ( 0.0 0.0 0.0 )
				)
			)
		)
			
		Light	(
			comment( Head light left btm HL=2or3)
			Type ( 0 )
			Conditions (
				Headlight ( 4 )
				Unit ( 2 )
			)
			FadeIn ( 0.25 )
			FadeOut ( 0.25 )
			Cycle	( 0 )
			States ( 1 
				State	(
					Duration ( 0.0 )
					LightColour ( ffffffc0 )
					Position ( 0.77 1.50 8.05 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.15 )
					Elevation ( 0.0 0.0 0.0 )
				)
			)
		)
		
		comment ( Unit 4 = back reversed cabs )

		Light	(
			comment( Red light right HL=2or3 )
			Type ( 0 )
			Conditions (
				Headlight ( 4 )
				Unit ( 4 )
			)
			FadeIn ( 0.25 )
			FadeOut ( 0.25 )
			Cycle	( 0 )
			States ( 1
				State	(
					Duration ( 0.0 )
					LightColour ( ffff0000 )
					Position ( -1 0.85 7.95 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.30 )
					Elevation ( 0.0 0.0 0.0 )
				)
			)
		)	

		Light	(
			comment( Red light left HL=2or3 )
			Type ( 0 )
			Conditions (
				Headlight ( 4 )
				Unit ( 4 )
			)
			FadeIn ( 0.25 )
			FadeOut ( 0.25 )
			Cycle	( 0 )
			States ( 1
				State	(
					Duration ( 0.0 )
					LightColour ( ffff0000 )
					Position ( 1 0.85 7.95 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.30 )
					Elevation ( 0.0 0.0 0.0 )
				)
			)
		)	

	) comment ( End of lights )

	Sound ( "LUReng.sms" )
)

Engine ( 1960Driving
	Wagon ( 1960Driving )
	Type ( Electric )
	MaxPower ( 210kW )
	MaxForce ( 40kN )
	MaxContinuousForce ( 40kN )
	comment ( following line sets max torque point typical for LT electric motor )
	DieselEngineSpeedOfMaxTractiveEffort( 10.0 )
	MaxVelocity ( 70mph )
	MaxCurrent ( 1000A )
	WheelRadius ( 0.788m )
	Sanding ( 1e9mph )
	NumWheels ( 1 )

	CabView ( 1959.cvf )
	HeadOut ( -1.5 2.2 6.5 )

      AirBrakesAirCompressorPowerRating( 2.0 )
      AirBrakesMainMinResAirPressure( 14.7 )
      AirBrakesMainMaxAirPressure( 90 )
      AirBrakesMainResVolume( 25 )
      AirBrakesAirCompressorWattage( 5000 )
      AirBrakesCompressorRestartPressure( 75 )
      AirBrakesAirUsedPerPoundsOfBrakePipePressure( 3.0 )
      AirBrakesHasLowPressureTest( 1 )
      AirBrakesIsCompressorElectricOrMechanical( 0 )

      TrainBrakesControllerMinPressureReduction( 2.5 )
      TrainBrakesControllerMaxApplicationRate( 5 )
      TrainBrakesControllerMaxReleaseRate( 5 )
      TrainBrakesControllerEmergencyApplicationRate( 15 )
      TrainBrakesControllerMinSystemPressure( 0 )
      TrainBrakesControllerMaxSystemPressure( 65 )
      TrainBrakesControllerEmergencyBrakeTimePenalty( 0 )
      TrainBrakesControllerFullServicePressureDrop( 13 )

      TrainPipeLeakRate( 10 )

	BrakesEngineBrakeType ( "Air_single_pipe"  )
	BrakesTrainBrakeType ( "Air_single_pipe" )

	BrakesEngineControllers( "Train" )
    
	DoesBrakeCutPower( 0 )
	DoesHornTriggerBell( 0 )

	OverspeedMonitor(
		MonitoringDeviceMonitorTimeLimit( 0 )
		MonitoringDeviceAlarmTimeLimit( 5 )
		MonitoringDeviceAlarmTimeBeforeOverspeed ( 5 )
		MonitoringDevicePenaltyTimeLimit( 0 )
		MonitoringDeviceCriticalLevel( 55 )
		MonitoringDeviceResetLevel( 0 )
		MonitoringDeviceAppliesFullBrake( 0 )
		MonitoringDeviceAppliesEmergencyBrake( 0 )
		MonitoringDeviceAppliesCutsPower( 0 )
		MonitoringDeviceAppliesShutSDownEngine( 0 )
		MonitoringDeviceTriggerOnTrackOverspeed( 1 )
		MonitoringDeviceTriggerOnTrackOverspeedMargin( 1 )
		MonitoringDeviceResetOnZeroSpeed( 1 ) 
		MonitoringDeviceResetOnResetButton( 1 )
	)

 	comment ( Real controller motoring positions are: Off, Shunt, Series, Parallel )
	comment ( Real brake positions are: Off, Graduated EP, Lap, Service, Emergency )
	comment ( The Lap/Service notches are the Westinghouse air brake notches and are not simulated )

	EngineControllers (
		Throttle ( 0 1 0.05 0 
			NumNotches ( 4
				Notch ( 0.00  0 Dummy )
				Notch ( 0.20  0 Dummy )
				Notch ( 0.50  0 Dummy )
				Notch ( 1.00  0 Dummy )
			)         
		)
		
		Brake_Train ( 0 1 0.05 0.30
            	NumNotches ( 5
				Notch ( 0.00  0 TrainBrakesControllerReleaseStart )
				Notch ( 0.10  0 TrainBrakesControllerHoldLappedStart )
				Notch ( 0.20  1 TrainBrakesControllerGraduatedSelfLapLimitedHoldingStart )
				Notch ( 0.90  0 TrainBrakesControllerSuppressionStart )
				Notch ( 1.00  0 TrainBrakesControllerEmergencyStart )
			)
		)

		DirControl ( -1 0 1 1 )
		EmergencyStopResetToggle( 0 1 0 )
		Horn ( 0 1 0 )
		BellToggle ( 0 1 0 )
		PantographToggle1 ( 0 1 1 )
		Headlights ( 0 0.25 1 0 )
		Wipers ( 0 1 0 )
	)

	Sound ( "LUReng.sms" )

    	Name ( "LT 1960 Central Line Tube stock" )

    	Description (
	"The London Transport 1960 Stock were built by Cravens. n"+
	"They were found only on the Central line.n"+
	"Power source: 3rd and 4th rail electric lines\n\n"+
	"Power: 3,750 hp\n\n"+
	"Max. speed permitted: 50 mph (80 km/h)\n\n"+
	"Height: 12 ft. 6 in. (4.06 m)\n\n"+
	"Width: 9 ft. 2 in. (2.9 m)\n\n"+
	"Length: 51 ft. 1 in. (20.15 m)\n\n"+
	"Brakes: MBSA, 4.0 km/h per second deceleration, 4.7 km/h per second emergency."
	)

	EngineOperatingProcedures (
 	""
	)
)
